Revit 2027 API
IFCUserDefinedPropertySet.ImportFromFile Method
 Import property sets from a text file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IFCUserDefinedPropertySet> ImportFromFile(
	Document document,
	string fileName,
	out bool validUserDefinedPropertySetFile
)
Public Shared Function ImportFromFile (
	document As Document,
	fileName As String,
	<OutAttribute> ByRef validUserDefinedPropertySetFile As Boolean
) As IList(Of IFCUserDefinedPropertySet)
public:
static IList<IFCUserDefinedPropertySet^>^ ImportFromFile(
	Document^ document,
	String^ fileName,
	[OutAttribute] bool% validUserDefinedPropertySetFile
)
static member ImportFromFile :
        document : Document *
        fileName : string *
        validUserDefinedPropertySetFile : bool byref -> IList<IFCUserDefinedPropertySet>
Parameters
document Document
 The Revit document.
fileName String
 The full text file name.
validUserDefinedPropertySetFile Boolean
 Whether or not the imported file with property sets is valid.
Return Value
IList<IFCUserDefinedPropertySet>
 The property set elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
FileAccessException |  Failed to access the text file.
InvalidOperationException |  Failed to create IFCUserDefinedPropertySet.
Remarks
 The imported property sets are saved in the document passed as parameter.
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace